eval/results/before_h100_23/20260327_215605/hybrid_bench.log
DEBUG_AG: Process 52511 importing vllm.config
DEBUG_AG: Process 52511 importing vllm.distributed
DEBUG_AG: Process 52511 importing vllm.distributed.communication_op
DEBUG_AG: Process 52511 importing vllm.distributed.parallel_state
DEBUG_AG: Process 52511 importing vllm.distributed.utils
DEBUG_AG: Process 52511 finished importing vllm.distributed.utils
DEBUG_AG: Process 52511 finished importing vllm.distributed.parallel_state
DEBUG_AG: Process 52511 importing vllm.platforms
DEBUG_AG: Process 52511 vllm.platforms import step 1 (torch)
DEBUG_AG: Process 52511 checking plugin heterogeneous
DEBUG_AG: Process 52511 checking plugin tpu
DEBUG_AG: Process 52511 checking plugin cuda
DEBUG_AG: Process 52511 finished nvmlShutdown in cuda_platform_plugin
DEBUG_AG: Process 52511 selected platform vllm.platforms.cuda.CudaPlatform
DEBUG_AG: Process 52511 importing vllm.platforms.cuda
DEBUG_AG: Process 52511 finished importing vllm.platforms.cuda
DEBUG_AG: Process 52511 finished importing vllm.distributed
DEBUG_AG: Process 52511 finished importing vllm.config
/workspace/vllm_hybrid/benchmarks/benchmark_serving.py:1298: DeprecationWarning: benchmark_serving.py is deprecated and will be removed in a future version. Please use 'vllm bench serve' instead.
  main(args)
Namespace(backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, no_stream=False, max_concurrency=None, model='Qwen/Qwen2.5-1.5B', tokenizer=None, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/workspace/vllm_hybrid/eval/./results/20260327_215605/hybrid.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=128, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 2000/2000 [01:03<00:00, 31.73it/s]
============ Serving Benchmark Result ============
Successful requests:                     1006      
Benchmark duration (s):                  63.03     
Total input tokens:                      128289    
Total generated tokens:                  503825    
Request throughput (req/s):              15.96     
Output token throughput (tok/s):         7993.18   
Total Token throughput (tok/s):          10028.49  
---------------Time to First Token----------------
Mean TTFT (ms):                          22002.89  
Median TTFT (ms):                        16423.01  
P99 TTFT (ms):                           45826.52  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.24     
Median TPOT (ms):                        28.58     
P99 TPOT (ms):                           109.31    
---------------Inter-token Latency----------------
Mean ITL (ms):                           27.85     
Median ITL (ms):                         25.14     
P99 ITL (ms):                            118.73    
==================================================